app/Views/LAYOUT/admin.php

SELECT *
FROM `admin`
WHERE `admin`.`id` = '1'
---
        if ($role === 'ADMIN') {
          $adminModel = new \App\Models\AdminModel();
          $adminId = session()->get('admin_id');
          $admin = $adminModel->find($adminId);