app/Helpers/logActivity_helper.php

INSERT INTO `activity_logs` (`user_id`, `role`, `action`, `details`, `url_accessed`, `created_at`) VALUES ('1', 'ADMIN', 'NAVIGATE', 'Accessed page: http://localhost:8080/DOCUMENTATION%20IT/dashboard/home', 'http://localhost:8080/DOCUMENTATION%20IT/dashboard/home', '2025-10-04 08:35:09')
---
    function logActivity($action, $details = '', $url = null)
    {
        $session = session();

        $userId = $session->get('user_id');
        $role   = $session->get('role');
        $url    = $url ?? current_url();

        // Jika tidak ada user_id di session, jangan catat
        if (!$userId || !$role) {
            return;
        }

        $db = \Config\Database::connect();
        $builder = $db->table('activity_logs');

        $builder->insert([
            'user_id'      => $userId,
            'role'         => $role,
            'action'       => $action,
            'details'      => $details,
            'url_accessed' => $url,
            'created_at'   => Time::now('Asia/Jakarta', 'en_US')
        ]);