app/Controllers/AuthController.php

    public function login()
    {
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        if (!$email || !$password) {
            return redirect()->back()->with('error', 'Email dan password wajib diisi!');
        }

        $userModel = new UserModel();
        $adminModel = new AdminModel();
        $picUserModel = new PicUserModel(); // Tambahkan model PICUSER

        // Cek apakah email ada di tabel admin
        $admin = $adminModel->where('email', $email)->first();
---
SELECT *
FROM `admin`
WHERE `email` = 'nicholas@helpdesk.com'
 LIMIT 1