app/Controllers/Home.php

    public function index()
    {
        // Inisialisasi model
        $ticketModel = new HelpdeskTicketModel();
        $picModel = new PicModel();
        $subjectModel = new SubjectModel();
        $vendorModel = new VendorModel();
        $invoiceModel = new InvoiceModel();

        $currentDate = date('Y-m-d');
        $currentMonth = date('m');
        $currentYear = date('Y');
        $previousMonth = date('m', strtotime('-1 month'));
        $previousYear = date('Y', strtotime('-1 month'));
        $startOfWeek = date('Y-m-d', strtotime('monday this week'));
        $endOfWeek = date('Y-m-d', strtotime('sunday this week'));

        // Ambil bulan dan tahun saat ini
        $currentMonth = date('m');
        $currentYear = date('Y');

        // Cek apakah ada tiket di bulan ini
        $ticketsMonthly = $ticketModel->select('COUNT(id) as ticket_count')
            ->where('MONTH(ticket_date)', $currentMonth)
            ->where('YEAR(ticket_date)', $currentYear)
            ->get()
            ->getRowArray();
---
SELECT COUNT(id) as ticket_count
FROM `helpdesk_tickets`
WHERE MONTH(ticket_date) = '10'
AND YEAR(ticket_date) = '2025'

            ->getResultArray();

        // Mengambil data tiket berdasarkan PIC dengan nama PIC
        $ticketsByPic = $ticketModel->select('helpdesk_tickets.pic_id, COUNT(helpdesk_tickets.id) as ticket_count, IFNULL(pics.name, "Unknown") as pic_name')
            ->join('pics', 'helpdesk_tickets.pic_id = pics.id', 'left')
            ->groupBy('helpdesk_tickets.pic_id')
            ->get()
            ->getResultArray();
---
SELECT `helpdesk_tickets`.`pic_id`, COUNT(helpdesk_tickets.id) as ticket_count, IFNULL(pics.name, "Unknown") as pic_name
FROM `helpdesk_tickets`
LEFT JOIN `pics` ON `helpdesk_tickets`.`pic_id` = `pics`.`id`
GROUP BY `helpdesk_tickets`.`pic_id`

        $totalTickets = $ticketModel->countAll();

        // Jumlah tiket per PIC per bulan
        $ticketsPerPIC = $ticketModel->select('helpdesk_tickets.pic_id, MONTH(ticket_date) as month, COUNT(helpdesk_tickets.id) as ticket_count, IFNULL(pics.name, "Unknown") as pic_name')
            ->join('pics', 'helpdesk_tickets.pic_id = pics.id', 'left')
            ->groupBy('helpdesk_tickets.pic_id, MONTH(ticket_date)')
            ->get()
            ->getResultArray();
---
SELECT `helpdesk_tickets`.`pic_id`, MONTH(ticket_date) as month, COUNT(helpdesk_tickets.id) as ticket_count, IFNULL(pics.name, "Unknown") as pic_name
FROM `helpdesk_tickets`
LEFT JOIN `pics` ON `helpdesk_tickets`.`pic_id` = `pics`.`id`
GROUP BY `helpdesk_tickets`.`pic_id`, MONTH(ticket_date)

            ->getResultArray();

        // Mengambil data lainnya
        $pics = $picModel->findAll();
        $subjects = $subjectModel->findAll();
        $vendors = $vendorModel->findAll();
        $invoices = $invoiceModel->findAll();
---
SELECT *
FROM `pics`
SELECT *
FROM `subjects`
SELECT *
FROM `vendors`
SELECT *
FROM `invoices`

            ->getResultArray();

        // Mengambil jumlah invoice berdasarkan vendor
        $invoicesByVendor = $invoiceModel->select('invoices.vendor_id, COUNT(invoices.id) as invoice_count, vendors.name as vendor_name')
            ->join('vendors', 'invoices.vendor_id = vendors.id', 'left')
            ->groupBy('invoices.vendor_id')
            ->get()
            ->getResultArray();
---
SELECT `invoices`.`vendor_id`, COUNT(invoices.id) as invoice_count, `vendors`.`name` as `vendor_name`
FROM `invoices`
LEFT JOIN `vendors` ON `invoices`.`vendor_id` = `vendors`.`id`
GROUP BY `invoices`.`vendor_id`