app/Controllers/NotificationController.php

    public function getNotifications()
    {
        $session = session();

        if (!$session->has('admin_id')) {
            log_message('error', 'Admin ID not found in session');
            return $this->response->setJSON([
                'status' => 403,
                'error' => 403,
                'messages' => ['error' => 'Admin not logged in']
            ])->setStatusCode(403);
        }

        $adminId = $session->get('admin_id');
        log_message('debug', 'Admin ID in session: ' . $adminId);

        $notifications = $this->notificationModel->where('admin_id', $adminId)->findAll();
---
SELECT *
FROM `notifications`
WHERE `admin_id` = '1'